cases/channelFlow5200/kOmega/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     simpleFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         15000;

deltaT          1;

writeControl    timeStep;
writeInterval   5000;
purgeWrite      0;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

libs ("libkOmegaDavidsonNN.so");
