cases/channelFlow5200/kOmega/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1;

vertices
(
    (0     0  0    )   // 0
    (0.01  0  0    )   // 1
    (0.01  1  0    )   // 2
    (0     1  0    )   // 3
    (0     0  0.01 )   // 4
    (0.01  0  0.01 )   // 5
    (0.01  1  0.01 )   // 6
    (0     1  0.01 )   // 7
);

blocks
(
    // 1 x 70 x 1, geometric ratio 1.1 per cell => last/first = 1.1^69 ~ 716
    hex (0 1 2 3 4 5 6 7) (1 70 1) simpleGrading (1 716 1)
);

edges ();

boundary
(
    bottom
    {
        type wall;
        faces ((0 1 5 4));
    }
    top
    {
        type symmetryPlane;
        faces ((3 7 6 2));
    }
    left
    {
        type cyclic;
        neighbourPatch right;
        faces ((0 4 7 3));
    }
    right
    {
        type cyclic;
        neighbourPatch left;
        faces ((1 2 6 5));
    }
    front
    {
        type empty;
        faces ((0 3 2 1));
    }
    back
    {
        type empty;
        faces ((4 5 6 7));
    }
);
