cases/channelFlow5200/kOmega/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
70
(
(0.005 6.3539634e-05 0.005)
(0.005 0.00019697011 0.005)
(0.005 0.00034373784 0.005)
(0.005 0.00050517597 0.005)
(0.005 0.00068275091 0.005)
(0.005 0.00087807564 0.005)
(0.005 0.0010929244 0.005)
(0.005 0.0013292486 0.005)
...
)
;

boundaryField
{
    bottom
    {
        type            calculated;
        value           uniform (0.005 0 0.005);
    }
    top
    {
        type            symmetryPlane;
    }
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
