cases/channelFlow5200/kOmega/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
70
(
0.005
0.005
0.005
0.005
0.005
0.005
0.005
0.005
...
)
;

boundaryField
{
    bottom
    {
        type            calculated;
        value           uniform 0.005;
    }
    top
    {
        type            symmetryPlane;
    }
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
