cases/channelFlow5200/kOmega/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottom
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    top
    {
        type            symmetryPlane;
    }
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}
