cases/channelFlow5200/kOmega/0/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 500;

boundaryField
{
    bottom
    {
        type            omegaWallFunction;
        value           uniform 1000;
    }
    top
    {
        type            symmetryPlane;
    }
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}
